; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph2 - mode
	thermograph1 - mode
	thermograph0 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star0 - direction
	Planet4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 172)
	(= (data Planet4 thermograph2) 118)
	(= (data Star5 thermograph2) 179)
	(= (data Star6 thermograph2) 277)
	(= (data Star7 thermograph2) 169)
	(= (data Planet8 thermograph2) 84)
	(= (data Planet4 thermograph1) 285)
	(= (data Star5 thermograph1) 149)
	(= (data Star6 thermograph1) 196)
	(= (data Star7 thermograph1) 288)
	(= (data Planet8 thermograph1) 145)
	(= (data Planet4 thermograph0) 296)
	(= (data Star5 thermograph0) 54)
	(= (data Star6 thermograph0) 168)
	(= (data Star7 thermograph0) 245)
	(= (data Planet8 thermograph0) 286)
	(= (slew_time GroundStation1 Star0) 16.07)
	(= (slew_time Star0 GroundStation1) 16.07)
	(= (slew_time Star2 Star0) 18.68)
	(= (slew_time Star0 Star2) 18.68)
	(= (slew_time Star2 GroundStation1) 35.5)
	(= (slew_time GroundStation1 Star2) 35.5)
	(= (slew_time GroundStation3 Star0) 20.66)
	(= (slew_time Star0 GroundStation3) 20.66)
	(= (slew_time GroundStation3 GroundStation1) 58)
	(= (slew_time GroundStation1 GroundStation3) 58)
	(= (slew_time GroundStation3 Star2) 1.433)
	(= (slew_time Star2 GroundStation3) 1.433)
	(= (slew_time Planet4 Star0) 38.67)
	(= (slew_time Star0 Planet4) 38.67)
	(= (slew_time Planet4 GroundStation1) 33.02)
	(= (slew_time GroundStation1 Planet4) 33.02)
	(= (slew_time Planet4 Star2) 5.273)
	(= (slew_time Star2 Planet4) 5.273)
	(= (slew_time Planet4 GroundStation3) 14.42)
	(= (slew_time GroundStation3 Planet4) 14.42)
	(= (slew_time Star5 Star0) 51.24)
	(= (slew_time Star0 Star5) 51.24)
	(= (slew_time Star5 GroundStation1) 14.91)
	(= (slew_time GroundStation1 Star5) 14.91)
	(= (slew_time Star5 Star2) 79.09)
	(= (slew_time Star2 Star5) 79.09)
	(= (slew_time Star5 GroundStation3) 53.16)
	(= (slew_time GroundStation3 Star5) 53.16)
	(= (slew_time Star5 Planet4) 17.85)
	(= (slew_time Planet4 Star5) 17.85)
	(= (slew_time Star6 Star0) 51.63)
	(= (slew_time Star0 Star6) 51.63)
	(= (slew_time Star6 GroundStation1) 15.35)
	(= (slew_time GroundStation1 Star6) 15.35)
	(= (slew_time Star6 Star2) 24.17)
	(= (slew_time Star2 Star6) 24.17)
	(= (slew_time Star6 GroundStation3) 16.83)
	(= (slew_time GroundStation3 Star6) 16.83)
	(= (slew_time Star6 Planet4) 3.067)
	(= (slew_time Planet4 Star6) 3.067)
	(= (slew_time Star6 Star5) 58.51)
	(= (slew_time Star5 Star6) 58.51)
	(= (slew_time Star7 Star0) 3.138)
	(= (slew_time Star0 Star7) 3.138)
	(= (slew_time Star7 GroundStation1) 47.23)
	(= (slew_time GroundStation1 Star7) 47.23)
	(= (slew_time Star7 Star2) 58.9)
	(= (slew_time Star2 Star7) 58.9)
	(= (slew_time Star7 GroundStation3) 25.45)
	(= (slew_time GroundStation3 Star7) 25.45)
	(= (slew_time Star7 Planet4) 35.39)
	(= (slew_time Planet4 Star7) 35.39)
	(= (slew_time Star7 Star5) 17.92)
	(= (slew_time Star5 Star7) 17.92)
	(= (slew_time Star7 Star6) 45.59)
	(= (slew_time Star6 Star7) 45.59)
	(= (slew_time Planet8 Star0) 74.4)
	(= (slew_time Star0 Planet8) 74.4)
	(= (slew_time Planet8 GroundStation1) 58.74)
	(= (slew_time GroundStation1 Planet8) 58.74)
	(= (slew_time Planet8 Star2) 26.39)
	(= (slew_time Star2 Planet8) 26.39)
	(= (slew_time Planet8 GroundStation3) 43.67)
	(= (slew_time GroundStation3 Planet8) 43.67)
	(= (slew_time Planet8 Planet4) 87.54)
	(= (slew_time Planet4 Planet8) 87.54)
	(= (slew_time Planet8 Star5) 67.17)
	(= (slew_time Star5 Planet8) 67.17)
	(= (slew_time Planet8 Star6) 34.83)
	(= (slew_time Star6 Planet8) 34.83)
	(= (slew_time Planet8 Star7) 72.83)
	(= (slew_time Star7 Planet8) 72.83)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet4 thermograph1)
	(have_image Star6 thermograph0)
	(have_image Star7 thermograph2)
	(have_image Planet8 thermograph2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 172 to 147.83, (fuel-used) from 0 to 24.17
   goals met: 0 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
3. (turn_to satellite0 planet4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 147.83 to 144.763, (fuel-used) from 24.17 to 27.237
   goals met: 0 of 4
4. (turn_to satellite0 star6 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 144.763 to 141.696, (fuel-used) from 27.237 to 30.304
   goals met: 0 of 4
5. (turn_to satellite0 planet4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 141.696 to 138.629, (fuel-used) from 30.304 to 33.371
   goals met: 0 of 4
6. (turn_to satellite0 star6 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 138.629 to 135.562, (fuel-used) from 33.371 to 36.438
   goals met: 0 of 4
7. (turn_to satellite0 planet4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 135.562 to 132.495, (fuel-used) from 36.438 to 39.505
   goals met: 0 of 4
8. (turn_to satellite0 star6 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 132.495 to 129.428, (fuel-used) from 39.505 to 42.572
   goals met: 0 of 4
9. (turn_to satellite0 planet4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 129.428 to 126.361, (fuel-used) from 42.572 to 45.639
   goals met: 0 of 4
10. (turn_to satellite0 star6 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 126.361 to 123.294, (fuel-used) from 45.639 to 48.706
   goals met: 0 of 4
11. (turn_to satellite0 planet4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 123.294 to 120.227, (fuel-used) from 48.706 to 51.773
   goals met: 0 of 4
12. (turn_to satellite0 star6 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 120.227 to 117.16, (fuel-used) from 51.773 to 54.84
   goals met: 0 of 4
13. (turn_to satellite0 planet4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 117.16 to 114.093, (fuel-used) from 54.84 to 57.907
   goals met: 0 of 4
14. (turn_to satellite0 groundstation3 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 114.093 to 99.673, (fuel-used) from 57.907 to 72.327
   goals met: 0 of 4
15. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 4
16. (turn_to satellite0 star7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 99.673 to 74.223, (fuel-used) from 72.327 to 97.777
   goals met: 0 of 4
17. (take_image satellite0 star7 instrument0 thermograph2)
   added: (have_image star7 thermograph2)
   changed: (data_capacity satellite0) from 1000 to 831, (data-stored) from 0 to 169
   goals met: 1 of 4
18. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 74.223 to 71.085, (fuel-used) from 97.777 to 100.915
   goals met: 1 of 4
19. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 1 of 4
20. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 4
21. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 1 of 4
22. (turn_to satellite0 star2 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 71.085 to 52.405, (fuel-used) from 100.915 to 119.595
   goals met: 1 of 4
23. (turn_to satellite0 planet4 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 52.405 to 47.132, (fuel-used) from 119.595 to 124.868
   goals met: 1 of 4
24. (turn_to satellite0 star6 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 47.132 to 44.065, (fuel-used) from 124.868 to 127.935
   goals met: 1 of 4
25. (take_image satellite0 star6 instrument1 thermograph0)
   added: (have_image star6 thermograph0)
   changed: (data_capacity satellite0) from 831 to 663, (data-stored) from 169 to 337
   goals met: 2 of 4
26. (turn_to satellite0 planet4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 44.065 to 40.998, (fuel-used) from 127.935 to 131.002
   goals met: 2 of 4
27. (take_image satellite0 planet4 instrument1 thermograph1)
   added: (have_image planet4 thermograph1)
   changed: (data_capacity satellite0) from 663 to 378, (data-stored) from 337 to 622
   goals met: 3 of 4
28. (turn_to satellite0 star2 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 40.998 to 35.725, (fuel-used) from 131.002 to 136.275
   goals met: 3 of 4
29. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 4
30. (switch_on instrument0 satellite0)
   deleted: (calibrated instrument0) (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 4
31. (turn_to satellite0 groundstation3 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 35.725 to 34.292, (fuel-used) from 136.275 to 137.708
   goals met: 3 of 4
32. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 3 of 4
33. (turn_to satellite0 star2 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 34.292 to 32.859, (fuel-used) from 137.708 to 139.141
   goals met: 3 of 4
34. (turn_to satellite0 planet8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 32.859 to 6.469, (fuel-used) from 139.141 to 165.531
   goals met: 3 of 4
35. (take_image satellite0 planet8 instrument0 thermograph2)
   added: (have_image planet8 thermograph2)
   changed: (data_capacity satellite0) from 378 to 294, (data-stored) from 622 to 706
   goals met: 4 of 4
